Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/benefits_and_entitlements_relating_to_birth.html.txt.tmx
Source language: en
Languages: ga

source: Benefits and entitlements relating to birth
ga: Sochair agus teidlíochtaí a bhaineann le bhreith

source: If you are having a baby in Ireland there are various benefits and entitlements relating to both employment and social welfare you may be able to avail of depending on your circumstances
ga: Má tá tú chun páiste a bheith agat in Éireann d’fhéadfá a bheith i dteideal leas a bhaint as teidlíochtaí a bhaineann le fostaíocht agus íocaíochtaí leasa shóisialaigh

source: If you become pregnant while in employment and you are exposed to certain risks in the workplace, or you are involved in nightwork, (i.e
ga: Má éiríonn tú torrach agus tú fostaithe agus má bhíonn tú nochtaithe do phriacail áirithe san áit oibre nó má bhíonn tú ag obair san oíche (i.e

source: spend at least three hours or 50% of your work between midnight-7am), you may be entitled to health and safety leave from work
ga: ag caitheamh trí huaire an chloig ar a laghad/50% de do chuid oibre idir meán oíche-7rn) d’fhéadfá a bheith i dteideal saoire sláinte agus sábháilteachta

source: If you are entitled to health and safety leave and you have sufficient social insurance contributions, you may also be entitled to Health and Safety Benefit from the Department of Social Protection while on leave
ga: Má tá tú i dteideal saoire sláinte agus sábháilteachta agus má tá dóthain ranníocaíochtaí árachas shóisialaigh agat, d’fhéadfá a bheith i dteideal Sochair Sláinte agus Sábháilteachta chomh maith ón Roinn Coimirce Sóisialaí fad is atá tú ar saoire

source: You may also be entitled to health and safety leave and Health and Safety Benefit when you return to work following the birth (only if you are breastfeeding)
ga: D’fhéadfá a bheith i dteideal saoire sláinte agus sábháilteachta agus Sochair Sláinte agus Sábháilteachta nuair a théann tú ar ais ag obair tar éis na breithe más rud é go mbíonn tú ag beathú ar an gcíoch

source: Before the birth you are entitled to take paid time off work to attend one set of antenatal classes
ga: Roimh an bhreith tá tú i dteideal am saor a thógáil le pá chun freastal ar aon seisiún amháin ranganna réamhbhreithe

source: This is a once-off right which covers all pregnancies while in employment
ga: Is ceart aon uaire é seo a chlúdaíonn gach aon toircheas le linn duit a bheith fostaithe

source: You may also take reasonable time off for medical visits both before and after the birth
ga: Féadfaidh tú am saor a thógáil atá réasúnta chun cuairteanna leighis a dhéanamh roimh agus tar éis an bhreith araon

source: Expectant fathers have a once-off right to attend two antenatal classes
ga: Tá ceart aon uaire ag fir le haghaidh clainne freastal ar dhá rang réamhbhreithe

source: All female employees in Ireland, no matter how long they have been working, are entitled to take maternity leave for a basic period of 26 weeks
ga: Tá sé de cheart ag gach bean atá fostaithe in Éireann, is cuma cén t-achar atá siad ag obair, saoire mháithreachais a ghlacadh ar feadh tréimhse bhunúsach 22 seachtaine

source: At least two weeks have to be taken before the end of the week of your baby's expected birth and at least four weeks taken after
ga: Caithfear coicís ar laghad a thógáil roimh dheireadh na seachtaine a bhfuil tú ag súil le breith do pháiste agus cheithre seachtain ar a laghad ina dhiaidh

source: You can also avail of an additional 16 weeks unpaid maternity leave
ga: Féadfaidh tú leas a bhaint as saoire mháithreachais ar feadh 12 seachtaine gan pá chomh maith

source: If a mother dies within 40 weeks of the birth, the father is entitled to maternity leave from work
ga: Má fhaigheann máthair bás taobh istigh de 40 seachtaine ón mbreith, tá an t-athair i dteideal saoire aithreachais ón obair

source: During the basic period of maternity leave you may be entitled to Maternity Benefit providing you satisfy the social insurance contribution conditions
ga: D’fhéadfá a bheith i dteideal Sochair Máithreachais i rith tréimhse bhunúsach na saoire máithreachais fad is go gcomhlíonann tú na coinníollacha ranníocaíochta árachas shóisialaigh

source: Paternity leave and Paternity Benefit
ga: Saoire atharthachta agus Sochar Atharthachta

source: New entitlements to paternity leave and Paternity Benefit are available from 1 September 2016
ga: Tá teidlíochtaí nua i bhfeidhm ó 1 Meán Fómhair 2016 i leith saoire atharthachta agus Sochar Atharthachta

source: In general, Child Benefit is payable from the first day of the month after the child is born
ga: Go ginearálta, tá Sochar Linbh iníoctha ón gcéad lá den mhí tar éis an leanbh a rugadh

source: It is paid at higher rates for multiple births such as twins or triplets
ga: Íoctar rátaí níos airde do Sochar Linbh nuair atá ilbhreitheanna i gceist ar nós cúpla nó trírín

source: If you are a medical card holder you are entitled to a Maternity Cash Grant of €10.16 from the Health Service Executive on the birth of your child
ga: Más sealbhóir cárta leighis thú tá tú i dteideal Deontas Airgid Mháithreachais €10.16 ó Fheidhmeannacht na Seirbhíse Sláinte ó breith do linbh

source: Apply to your Local Health Office
ga: Déan iarratas ar d’Oifig Sláinte Áitiúil

source: If your income is insufficient to meet the costs associated with your baby you may be able to apply for an Exceptional Needs Payment from the Department of Social Protection's representative (formerly known as the Community Welfare Officer)
ga: Mura bhfuil dóthain ioncam agat faoi chomhair na gcostas a bhaineann le do leanbh b’fhéidir go mbeifeá ábalta iarratas a dhéanamh ar Íocaíocht do Riachtanais Eisceachtúla chuig an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo)

source: If you are parenting alone you may be entitled to the One Parent Family Payment which is a means-tested payment from the Department of Social Protection
ga: Más rud é go bhfuil tú i do thuismitheoir aonair d’fhéadfá a bheith i dteideal Íocaíocht Teaghlach Aontuismitheora

source: You can receive Maternity Benefit at a reduced rate, if you are getting One Parent Family Payment
ga: Féadfaidh tú Sochar Máithreachais a fháil ag ráta laghdaithe má tá tú ag fáil Íocaíocht Teaghlach Aontuismitheora

source: When you return to work you may be able to avail of parental leave
ga: Nuair a théann tú ar ais ag obair d’fhéadfá a bheith ábalta leas a bhaint as Saoire do Thuismitheoirí

source: You are not entitled to pay from your employer while you are on parental leave nor are you entitled to any social welfare payment equivalent to Maternity Benefit
ga: Níl tú i dteideal pá a fháil ó d’fhostóir agus tú ar saoire do thuismitheoirí agus níl tú i dteideal íocaíocht leasa shóisialaigh cothrom le Sochair Máithreachais ach oiread
